Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: // in Subroutine() to abort the entire test.
it_it: // in Subroutine() abortisca l'intero test.

source: // in subclasses of FooTest and lead to memory leak.
it_it: // nelle sottoclassi di FooTest portando a memory leak.

source: // in their natural order.
it_it: // nel loro ordine naturale.

source: // initialization code here
it_it: // codice di inizializzazione qui

source: // is NULL.
it_it: // è NULL.

source: // it's fine to perform this action later, since a copy of the values
it_it: // va bene eseguire questa azione in un secondo momento, poiché una copia dei valori

source: // it, will be passed to the callback.
it_it: // non una sua copia.

source: // just the method wasn't called.
it_it: // semplicemente il metodo non è stato chiamato.

source: // log message.
it_it: // al messaggio del log.

source: // m is a Matcher<Base*> we got from somewhere.
it_it: // m è un Matcher<Base*> che abbiamo ottenuto da qualche parte.

source: // methods are protected or private in the base class.
it_it: // metodi sono protected o private nella classe base.

source: // normal test } TEST_F(FooDeathTest, DoesThat) {
it_it: // test normale } TEST_F(FooDeathTest, DoesThat) {

source: // of the TestWithParam<T> class:
it_it: // della classe TestWithParam<T>:

source: // ok to through exceptions from here if need be
it_it: // ok per le eccezioni da qui, se necessario

source: // parameter.
it_it: // del parametro.

source: // prefix.
it_it: // come prefisso.

source: // put in any custom data members that you need
it_it: // inserire tutti i membri dati personalizzati necessari

source: // q0_ remains empty
it_it: // q0_ resta vuoto

source: // reallocation should be prevented because `SetUpTestSuite()` may be called
it_it: // la riallocazione dovrebbe essere impedita perché potrebbe essere chiamato `SetUpTestSuite()`

source: // result to 'listener'.
it_it: // della corrispondenza a 'listener'.

source: // return value works for us.
it_it: // funziona il valore restituito di default.

source: // reverse order.
it_it: // nell'ordine inverso.

source: // second argument DoThis() receives.
it_it: // secondo argomento che riceve DoThis().

source: // server now owns foo.
it_it: // il server ora possiede foo.

source: // std::ref(helper) guarantees that a reference to helper, not a copy of
it_it: // std::ref(helper) garantisce che al callback verrà passato un riferimento all'helper,

source: // template on its first argument.
it_it: // template sul suo primo argomento.

source: // temporary and dead once the EXPECT_CALL() statement finishes.
it_it: // temporanei e inattivi una volta terminata l'istruzione EXPECT_CALL().

source: // that has three members MatchAndExplain(), DescribeTo(), and
it_it: // che abbia tre membri MatchAndExplain(), DescribeTo(), e

source: // the above methods delegate to this one:
it_it: // i metodi precedenti delegano questo:

source: // the compiler will generate them in every translation unit
it_it: // il compilatore li genererà in ogni unità di traduzione

source: // this will verify the expectations anyway.
it_it: // questo verificherà comunque le expectation.

source: // to avoid interfere with other tests.
it_it: // per evitare interferenze con altri test.

source: // to return void.
it_it: // deve restituire void.

source: // us to visit the members of FooTest via 'this'.
it_it: // di visitare i membri di FooTest tramite 'this'.

source: // us to visit the members of MyFixture via 'this'.
it_it: // di visitare i membri di MyFixture tramite 'this'.

source: // where this mock class is used.
it_it: // in cui viene utilizzata questa classe mock.

source: // will return a new Buzz object.
it_it: // che restituirà un nuovo oggetto Buzz.

source: // will trigger the above EXPECT_CALL.
it_it: // attiverà la precedente EXPECT_CALL.

source: 10: void Sub1(int n) { 11: EXPECT_EQ(Bar(n), 1); 12: EXPECT_EQ(Bar(n + 1), 2); 13: } 14: 15: TEST(FooTest, Bar) { 16: { 17: SCOPED_TRACE("A"); // This trace point will be included in 18: // every failure in this scope.
it_it: 10: void Sub1(int n) { 11: EXPECT_EQ(Bar(n), 1); 12: EXPECT_EQ(Bar(n + 1), 2); 13: } 14: 15: TEST(FooTest, Bar) { 16: { 17: SCOPED_TRACE("A"); // Questo punto di trace verrà incluso in 18: // in ogni errore in questo scope.

source: 19: Sub1(1); 20: } 21: // Now it won't.
it_it: 19: Sub1(1); 20: } 21: // Adesso non lo farà più.

source: 3 and #4 can be done either in one thread or in multiple threads - anyway
it_it: 3 e #4 possono essere eseguiti in un thread o in più thread,

source: :-( Or do you really?
it_it: :-( Oh! veramente?

source: :-) If you don't mind, I'd suggest you to give both approaches a try.
it_it: :-) Se possibile, suggeriamo di provare entrambi gli approcci.

source: ::testing::ExitedWithCode(exit_code); // Returns true if the program was killed by the given signal.
it_it: ::testing::ExitedWithCode(exit_code); // Restituisce true se il programma è stato terminato [kill] dal segnale fornito.

source: p_i is the name of the i-th value parameter.
it_it: p_i è il nome del parametro valore i-esimo.

source: "gtest/gtest-spi.h" contains some constructs to do this.
it_it: "gtest/gtest-spi.h" contiene alcuni costrutti per farlo.

source: ./foo_test --gtest_filter=* Also runs everything, due to the single match-everything * value.
it_it: ./foo_test --gtest_filter=* Esegue tutto, a causa del singolo valore * corrispondente a tutto.

source: ./foo_test --gtest_filter=*Null*:*Constructor* Runs any test whose full name contains either "Null" or "Constructor" .
it_it: ./foo_test --gtest_filter=*Null*:*Constructor* Esegue qualsiasi test il cui nome completo contenga "Null" o "Constructor".

source: ./foo_test --gtest_filter=-*DeathTest.* Runs all non-death tests.
it_it: ./foo_test --gtest_filter=-*DeathTest.* Esegue tutti i test non-death.

source: ./foo_test --gtest_filter=FooTest.*-FooTest.Bar Runs everything in test suite FooTest except FooTest.Bar.
it_it: ./foo_test --gtest_filter=FooTest.*-FooTest.Bar Esegue tutto nella test suite FooTest tranne FooTest.Bar.

source: ./foo_test --gtest_filter=FooTest.*:BarTest.*-FooTest.Bar:BarTest.Foo Runs everything in test suite FooTest except FooTest.Bar and everything in test suite BarTest except BarTest.Foo.
it_it: ./foo_test --gtest_filter=FooTest.*:BarTest.*-FooTest.Bar:BarTest.Foo Esegue tutto nella test suite FooTest tranne FooTest.Bar e tutto nella test suite BarTest tranne BarTest.Foo.

source: ./foo_test --gtest_filter=FooTest.* Runs everything in test suite FooTest .
it_it: ./foo_test --gtest_filter=FooTest.* Esegue tutto nella test suite FooTest .

source: ./foo_test Has no flag, and thus runs all its tests.
it_it: ./foo_test Non ha flag e quindi esegue tutti i suoi test.

source: Actions specify what a mock function should do when invoked.
it_it: Le action specificano cosa dovrebbe fare una funzione mock quando viene invocata.

source: Calltype(...) - Sets the call type for the method (e.g. to STDMETHODCALLTYPE), useful in Windows.
it_it: Calltype(...) - Imposta il tipo di chiamata per il metodo (ad esempio su STDMETHODCALLTYPE), utile in Windows.

source: ON_CALL is likely the single most under-utilized construct in gMock.
it_it: ON_CALL è probabilmente il costrutto singolo più sotto-utilizzato in gMock.

source: const - Makes the mocked method a const method.
it_it: const - Rende il metodo mock-ato un metodo const.

source: key must be a valid XML attribute name, and cannot conflict with the ones already used by GoogleTest (name, status, time, classname, type_param, and value_param).
it_it: key deve essere un nome di un attributo XML valido e non può entrare in conflitto con quelli già utilizzati da GoogleTest (name, status, time, classname, type_param e value_param).

source: noexcept - Marks the method with noexcept.
it_it: noexcept - Contrassegna il metodo con noexcept.

source: override - Marks the method with override.
it_it: override - Contrassegna il metodo con override.

source: ref(...) - Marks the method with the reference qualification specified.
it_it: ref(...) - Contrassegna il metodo con la qualifica del riferimento specificata.

source: <testcase> elements correspond to GoogleTest test functions.
it_it: Gli elementi <testcase> corrispondono alle funzioni di test di GoogleTest.

source: <testsuite> elements correspond to GoogleTest test suites.
it_it: Gli elementi <testsuite> corrispondono alle test suite di GoogleTest.

source: A<type>() or An<type>()
it_it: A<type>() o An<type>()

source: ACTION_TEMPLATE and ACTION/ACTION_P* can be overloaded on the number of value parameters, but not on the number of template parameters.
it_it: ACTION_TEMPLATE e ACTION/ACTION_P* si possono overload-are sul numero di parametri valore, ma non sul numero di parametri template.

source: ASSERT_* versions generate fatal failures when they fail, and abort the current function.
it_it: Le versioni ASSERT_* generano errori fatali quando falliscono e interrompono la funzione corrente.

source: ASSERT_DEATH(statement, matcher) (or any death assertion macro) can be used wherever statement is valid.
it_it: ASSERT_DEATH(statement, matcher) (o qualsiasi macro di asserzione death) può essere utilizzato ovunque sia valido statement.

source: AbslStringify() can also use absl::StrFormat's catch-all %v type specifier within its own format strings to perform type deduction.
it_it: AbslStringify() può anche usare, di absl::StrFormat, l'identificatore di tipo "tuttofare" %v all'interno delle proprie stringhe di formato per eseguire la deduzione del tipo.

source: AddressSatisfies(callback) and Truly(callback) take ownership of callback, which must be a permanent callback.
it_it: AddressSatisfies(callback) e Truly(callback) prendono la proprietà di callback, che deve essere una callback permanente.

source: AllOfArray({m0, m1, ..., mn}), AllOfArray(a_container), AllOfArray(begin, end), AllOfArray(array), or AllOfArray(array, count)
it_it: AllOfArray({m0, m1, ..., mn}), AllOfArray(a_container), AllOfArray(begin, end), AllOfArray(array) o AllOfArray(array, count)

source: An unexpected call is always an error, as the code under test doesn't behave the way the test expects it to behave.
it_it: Una chiamata unexpected è sempre un errore, poiché il codice sottoposto a test non si comporta come il test si aspetta che si comporti.

source: AnyOfArray({m0, m1, ..., mn}), AnyOfArray(a_container), AnyOfArray(begin, end), AnyOfArray(array), or AnyOfArray(array, count)
it_it: AnyOfArray({m0, m1, ..., mn}), AnyOfArray(a_container), AnyOfArray(begin, end), AnyOfArray(array) o AnyOfArray(array, count)

source: Assertions used within the test body determine the outcome of the test.
it_it: Le asserzioni utilizzate all'interno del corpo del test determinano l'esito del test.

source: Availability: Linux, Windows, Mac.
it_it: Disponibilità: Linux, Windows, Mac.

source: BEST PRACTICE: Prefer to make the comparison explicit via EXPECT_THAT(actual_value, Eq(expected_value)) or EXPECT_EQ(actual_value, expected_value).
it_it: BEST PRACTICE: È preferibile rendere esplicito il confronto tramite EXPECT_THAT(actual_value, Eq(expected_value)) o EXPECT_EQ(actual_value, expected_value).

source: Bazel, the preferred build system used by the GoogleTest team.
it_it: Bazel, è il sistema di build preferito utilizzato dal team di GoogleTest.

source: By default, an uninteresting call is not an error, as it violates no constraint specified by the test.
it_it: Per default, una chiamata uninteresting non è un errore, poiché non viola alcun vincolo specificato dal test.

source: CMake and a compatible build tool for building the project.
it_it: CMake e uno strumento di build compatibile per il progetto.

source: Caveat: When used inside a member function of a class template or a function template, StaticAssertTypeEq<T1, T2>() is effective only if the function is instantiated.
it_it: Avvertenza: Se utilizzato all'interno di una funzione membro di una classe template o di una funzione template, StaticAssertTypeEq<T1, T2>() è efficace solo se viene istanziata la funzione.

source: Check out the Primer to start learning how to write simple tests.
it_it: Consultare la Guida per iniziare a scrivere semplici test.

source: Concrete's API may not fit your problem domain very well, as you may not be the only client it tries to serve.
it_it: L'API di Concrete potrebbe non adattarsi molto bene al dominio del problema, poiché si potrebbe non essere l'unico cliente che si tenta di servire.

source: ContainsRegex() and MatchesRegex() take ownership of the RE object.
it_it: ContainsRegex() e MatchesRegex() assumono la proprietà dell'oggetto RE.

source: DoAll() allows you to do a sequence of actions every time.
it_it: DoAll() consente di eseguire una sequenza di azioni ogni volta.

source: DoubleEq() and FloatEq() conform to the IEEE standard, which requires comparing two NaNs for equality to return false.
it_it: DoubleEq() e FloatEq() sono conformi allo standard IEEE, che richiede il confronto di due NaN affinché l'uguaglianza restituisca false.

source: ElementsAre*() can be used to match any container that implements the STL iterator pattern (i.e. it has a const_iterator type and supports begin()/end()), not just the ones defined in STL.
it_it: ElementsAre*() è utilizzabile per [to match] qualsiasi container che implementi il pattern dell'iteratore STL (ovvero ha un tipo const_iterator e supporta begin()/end()), non solo quelli definiti in STL.

source: ElementsAreArray({e0, e1, ..., en}), ElementsAreArray(a_container), ElementsAreArray(begin, end), ElementsAreArray(array), or ElementsAreArray(array, count)
it_it: ElementsAreArray({e0, e1, ..., en}), ElementsAreArray(a_container), ElementsAreArray(begin, end), ElementsAreArray(array), o ElementsAreArray(array, count)

source: Eq(value) or value
it_it: Eq(value) o value

source: Exactly(n) or n
it_it: Exactly(n) o n

source: Fake objects have working implementations, but usually take some shortcut (perhaps to make the operations less expensive), which makes them not suitable for production.
it_it: Gli oggetti fake hanno implementazioni funzionanti, ma solitamente prendono qualche scorciatoia (magari per rendere le operazioni meno costose), che li rende non adatti alla produzione.

source: Field() and Property() can also match plain pointers to objects.
it_it: Field() e Property() possono anche eseguire il match di semplici puntatori a oggetti.

source: GTEST_SKIP() can be used in individual test cases or in the SetUp() methods of classes derived from either ::testing::Environment or ::testing::Test.
it_it: GTEST_SKIP() è utilizzabile nei casi di test individuali o nei metodi SetUp() di una classe derivata da ::testing::Environment o da ::testing::Test.

source: GoogleTest Advanced - Read this when you've finished the Primer and want to utilize GoogleTest to its full potential.
it_it: GoogleTest Advanced - Leggere questo, dopo la Guida per utilizzare GoogleTest al massimo delle sue potenzialità.

source: GoogleTest FAQ - Have a question?
it_it: FAQ di GoogleTest - Ci sono domande?

source: GoogleTest Primer - Teaches you how to write simple tests using GoogleTest.
it_it: Guida di GoogleTest - Insegna come scrivere semplici test utilizzando GoogleTest.

source: GoogleTest Samples - Describes some GoogleTest samples.
it_it: Esempi di Googletest - Descrive degli esempi di GoogleTest.

source: GoogleTest helps you write better C++ tests.
it_it: GoogleTest aiuta a scrivere meglio i test di C++.

source: Googlemock Insights, by ElectricRCAircraftGuy
it_it: Googlemock Insights, di ElectricRCAircraftGuy

source: HasFatalFailure() in the ::testing::Test class returns true if an assertion in the current test has suffered a fatal failure.
it_it: HasFatalFailure() nella classe ::testing::Test restituisce true se un'asserzione nel test corrente ha subito un fallimento fatale.

source: ISTQB Term
it_it: Termine ISTQB

source: If you still find yourself needing to test internal implementation code, consider if there's a better design. The desire to test internal implementation is often a sign that the class is doing too much.
it_it: Se ci si ritrova ancora a dover testare il codice dell'implementazione interna, considerare se esiste un design migliore. Il desiderio di testare l'implementazione interna è spesso un segno che la classe sta facendo troppo.

source: Important note: The EXPECT_CALL() statement evaluates the action clause only once, even though the action may be performed many times.
it_it: Nota importante: L'istruzione EXPECT_CALL() valuta la clausola dell'azione una sola volta, anche se l'azione può essere eseguita più volte.

source: Important note: gMock requires expectations to be set before the mock functions are called, otherwise the behavior is undefined.
it_it: Nota importante: gMock richiede che le expectation siano impostate prima di chiamare le funzioni mock, altrimenti il comportamento è indefinito.

source: Invoke() passes the mock function's arguments to the function, etc being invoked such that the callee has the full context of the call to work with.
it_it: Invoke() passa gli argomenti della funzione mock alla funzione, ecc. invocata in modo tale che il chiamato abbia l'intero contesto della chiamata con cui lavorare.

source: Invoke(callback) and InvokeWithoutArgs(callback) take ownership of callback, which must be permanent.
it_it: Invoke(callback) e InvokeWithoutArgs(callback) assumono la proprietà di callback, che deve essere permanente.

source: IsSubsetOf({e0, e1, ..., en}), IsSubsetOf(a_container), IsSubsetOf(begin, end), IsSubsetOf(array), or IsSubsetOf(array, count)
it_it: IsSubsetOf({e0, e1, ..., en}), IsSubsetOf(a_container), IsSubsetOf(begin, end), IsSubsetOf(array) o IsSubsetOf(array, count)

source: IsSupersetOf({e0, e1, ..., en}), IsSupersetOf(a_container), IsSupersetOf(begin, end), IsSupersetOf(array), or IsSupersetOf(array, count)
it_it: IsSupersetOf({e0, e1, ..., en}), IsSupersetOf(a_container), IsSupersetOf(begin, end), IsSupersetOf(array) o IsSupersetOf(array, count)

source: IsTrue and IsFalse are useful when you need to use a matcher, or for types that can be explicitly converted to Boolean, but are not implicitly converted to Boolean.
it_it: IsTrue e IsFalse sono utili quando è necessario utilizzare un matcher o per tipi che possono essere convertiti esplicitamente in booleano, ma non lo sono implicitamente.

source: MOCK_METHOD must be used in the public: section of a mock class definition, regardless of whether the method being mocked is public, protected, or private in the base class.
it_it: MOCK_METHOD deve essere utilizzata nella sezione public: di una definizione di classe mock, indipendentemente dal fatto che il metodo mock-ato sia public, protected o private nella classe base.

source: MOCK_METHOD removes the parentheses.
it_it: MOCK_METHOD rimuove le parentesi.

source: MatcherCast essentially lets you bypass C++'s type system (static_cast isn't always safe as it could throw away information, for example), so be careful not to misuse/abuse it.
it_it: MatcherCast consente essenzialmente di aggirare il sistema di tipi di C++ (static_cast non è sempre sicuro in quanto potrebbe eliminare informazioni, ad esempio), si faccia quindi attenzione a non abusarne.

source: MeenyMinyMoe/FooTest.DoesBlah/0 for "meeny"
it_it: MeenyMinyMoe/FooTest.DoesBlah/0 per "meeny"

source: MeenyMinyMoe/FooTest.DoesBlah/1 for "miny"
it_it: MeenyMinyMoe/FooTest.DoesBlah/1 per "miny"

source: MeenyMinyMoe/FooTest.DoesBlah/2 for "moe"
it_it: MeenyMinyMoe/FooTest.DoesBlah/2 per "moe"

source: MeenyMinyMoe/FooTest.HasBlahBlah/0 for "meeny"
it_it: MeenyMinyMoe/FooTest.HasBlahBlah/0 per "meeny"

source: MeenyMinyMoe/FooTest.HasBlahBlah/1 for "miny"
it_it: MeenyMinyMoe/FooTest.HasBlahBlah/1 per "miny"

source: MeenyMinyMoe/FooTest.HasBlahBlah/2 for "moe"
it_it: MeenyMinyMoe/FooTest.HasBlahBlah/2 per "moe"

source: MockFunction<R(T1, ..., Tn)> has a mock method Call() with the signature:
it_it: MockFunction<R(T1, ..., Tn)> ha un metodo mock Call() con la signature:

source: Mocking Cheat Sheet - A handy reference for matchers, actions, invariants, and more.
it_it: Cheat Sheet del Mocking - Un pratico riferimento per matcher, azioni, invarianti e altro.

source: Mocking Cookbook - Includes tips and approaches to common mocking use cases.
it_it: Mocking Cookbook - Include suggerimenti e approcci ai casi d'uso comuni di mocking.

source: Mocking FAQ - Contains answers to some mocking-specific questions.
it_it: Mocking FAQ - Contiene le risposte ad alcune domande specifiche sul mocking.

source: Mocking for Dummies - Teaches you how to create mock objects and use them in tests.
it_it: Mocking per Principianti - Insegna come creare oggetti mock e come utilizzarli nei test.

source: Mocks are objects pre-programmed with expectations, which form a specification of the calls they are expected to receive.
it_it: I mock sono oggetti preprogrammati con delle aspettative, che formano una specifica delle chiamate che si aspettano di ricevere.

source: NiceMock<MockFoo> and StrictMock<MockFoo> may not work correctly if the destructor of MockFoo is not virtual.
it_it: NiceMock<MockFoo> e StrictMock<MockFoo> potrebbero non funzionare correttamente se il distruttore di MockFoo non è virtuale.

source: NiceMock<MockFoo> and StrictMock<MockFoo> only work for mock methods defined using the MOCK_METHOD macro directly in the MockFoo class.
it_it: NiceMock<MockFoo> e StrictMock<MockFoo> funzionano solo per i metodi mock definiti utilizzando la macro MOCK_METHOD direttamente nella classe MockFoo.

source: NiceMock<MockFoo> is a subclass of MockFoo, so it can be used wherever MockFoo is accepted.
it_it: NiceMock<MockFoo> è una sottoclasse di MockFoo, quindi può essere utilizzata ovunque sia accettata MockFoo.

source: NiceMock<T> might not work correctly if the destructor of T is not virtual.
it_it: NiceMock<T> potrebbe non funzionare correttamente se il distruttore di T non è virtuale.

source: NiceMock<T> only works for mock methods defined using the MOCK_METHOD macro directly in the definition of class T.
it_it: NiceMock<T> funziona solo con metodi mock definiti utilizzando la macro MOCK_METHOD direttamente nella definizione della classe T.

source: Notes:
it_it: Note:

source: Pets/FooTest.DoesBlah/0 for "cat"
it_it: Pets/FooTest.DoesBlah/0 per "cat"

source: Pets/FooTest.DoesBlah/1 for "dog"
it_it: Pets/FooTest.DoesBlah/1 per "dog"

source: Pets/FooTest.HasBlahBlah/0 for "cat"
it_it: Pets/FooTest.HasBlahBlah/0 per "cat"

source: Pets/FooTest.HasBlahBlah/1 for "dog"
it_it: Pets/FooTest.HasBlahBlah/1 per "dog"

source: Pointee(m) matches a pointer if and only if m matches the value the pointer points to.
it_it: Pointee(m) esegue il matching di un puntatore se e solo se m corrisponde al valore a cui punta il puntatore.

source: Quick quiz: what do you think will happen if a function is expected to be called twice but actually called four times?
it_it: Quiz veloce: cosa accadrà se si prevede che una funzione venga chiamata due volte ma in realtà viene chiamata quattro volte?

source: RUN_ALL_TESTS() should be invoked after the command line has been parsed by InitGoogleTest().
it_it: RUN_ALL_TESTS() deve essere richiamato dopo che la riga di comando è stata analizzata da InitGoogleTest().

source: RecordProperty() is a static member of the Test class.
it_it: RecordProperty() è un membro statico della classe Test.

source: RecordProperty is public static so it can be called from utility functions that are not members of the test fixture.
it_it: RecordProperty è public static quindi può essere chiamato da funzioni di utilità che non sono membri della fixture.
